STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233axx_ca35.h
/*
 * @brief DDRDBG block description (DDRDBG)
 */
typedef struct
{
  __IO uint32_t LP_DISABLE;                       /*!< DDRDBG low-power disable register                 Address offset: 0x000  */
  __IO uint32_t BYPASS_PCLKEN;                    /*!< DDRDBG bypass PCLKEN register                     Address offset: 0x004  */
  __IO uint32_t DDRC_AUTO_SR_DELAY;               /*!< DDRDBG DDRC auto SR delay register                Address offset: 0x008  */
  __IO uint32_t OBSP_CTRL;                        /*!< DDRDBG OBSP control register                      Address offset: 0x00C  */
  __IO uint32_t FRAC_PLL_LOCK;                    /*!< DDRDBG FRAC PLL lock register                     Address offset: 0x010  */
  __IO uint32_t DTO_OUTPUT;                       /*!< DDRDBG DTO output register                        Address offset: 0x014  */
       uint32_t RESERVED0[6];                     /*!< Reserved                                          Address offset: 0x018-0x02C */
  __IO uint32_t DFI_ERRORS_CTRL;                  /*!< DDRDBG DFI error control register                 Address offset: 0x030  */
  __IO uint32_t DFI_ERROR_STATUS;                 /*!< DDRDBG DFI error status register                  Address offset: 0x034  */
  __IO uint32_t DFI_ERROR_MSK;                    /*!< DDRDBG DFI error mask register                    Address offset: 0x038  */
       uint32_t RESERVED1[49];                    /*!< Reserved                                          Address offset: 0x03C-0x0FC */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD3_0;          /*!< DDRDBG DDR34 AC swizzle ADD3_0 register           Address offset: 0x100  */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD7_4;          /*!< DDRDBG DDR34 AC swizzle ADD7_4 register           Address offset: 0x104  */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD11_8;         /*!< DDRDBG DDR34 AC swizzle ADD11_8 register          Address offset: 0x108  */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD15_12;        /*!< DDRDBG DDR34 AC swizzle ADD15_12 register         Address offset: 0x10C  */
  __IO uint32_t DDR34_AC_SWIZZLE_BK2_0_ACTN;      /*!< DDRDBG DDR34 AC swizzle BK2 0 ACTN register       Address offset: 0x110  */
  __IO uint32_t DDR34_AC_SWIZZLE_RASN_CASN_BG1_0; /*!< DDRDBG DDR34 AC swizzle RASN CASN BG1_0 register  Address offset: 0x114  */
  __IO uint32_t DDR34_AC_SWIZZLE_WEN;             /*!< DDRDBG DDR34 AC swizzle WEN register              Address offset: 0x118  */
} DDRDBG_TypeDef;

/*
 * @brief DDRPERFM unit (DDRPERFM)
 */
typedef struct
{
  __IO uint32_t CTRL;         /*!< Control Register                    Address offset: 0x000 */
  __IO uint32_t IMSK;         /*!< Interrupt Mask Register             Address offset: 0x004 */
  __IO uint32_t ICLR;         /*!< Interrupt Clear Register            Address offset: 0x008 */
  __IO uint32_t CLR;          /*!< Interrupt Counter Clear Register    Address offset: 0x00C */
  __IO uint32_t CFG0;         /*!< Configuration Register 0            Address offset: 0x010 */
  __IO uint32_t CFG1;         /*!< Configuration Register 1            Address offset: 0x014 */
  __IO uint32_t CFG2;         /*!< Configuration Register 2            Address offset: 0x018 */
  __IO uint32_t CFG3;         /*!< Configuration Register 3            Address offset: 0x01C */
  __IO uint32_t CFG4;         /*!< Configuration Register 4            Address offset: 0x020 */
  __IO uint32_t CFG5;         /*!< Event Counter Enable Register       Address offset: 0x024 */
  __IO uint32_t DRAMINF;      /*!< DRAM Information Register           Address offset: 0x028 */
       uint32_t RESERVED0[5]; /*!< Reserved                            Address offset: 0x02C-0x03C */
  __IO uint32_t EVCNT0;       /*!< Event Counter 0 Register            Address offset: 0x040 */
  __IO uint32_t EVCNT1;       /*!< Event Counter 1 Register            Address offset: 0x044 */
  __IO uint32_t EVCNT2;       /*!< Event Counter 2 Register            Address offset: 0x048 */
  __IO uint32_t EVCNT3;       /*!< Event Counter 3 Register            Address offset: 0x04C */
  __IO uint32_t EVCNT4;       /*!< Event Counter 4 Register            Address offset: 0x050 */
  __IO uint32_t EVCNT5;       /*!< Event Counter 5 Register            Address offset: 0x054 */
  __IO uint32_t EVCNT6;       /*!< Event Counter 6 Register            Address offset: 0x058 */
  __IO uint32_t EVCNT7;       /*!< Event Counter 7 Register            Address offset: 0x05C */
  __IO uint32_t TCNT;         /*!< Time Counter Register               Address offset: 0x060 */
       uint32_t RESERVED1[7]; /*!< Reserved                            Address offset: 0x064-0x07C */
  __IO uint32_t STATUS;       /*!< Status Register                     Address offset: 0x080 */
} DDRPERFM_TypeDef;
/**
  * @brief DMA Controller
  */
/* c7amba_dma3_v1_0 */
typedef struct
{
  __IO uint32_t SECCFGR;          /*!< DMA secure configuration register,                      Address offset: 0x00  */
  __IO uint32_t PRIVCFGR;         /*!< DMA privileged configuration register,                  Address offset: 0x04  */
  __IO uint32_t RCFGLOCKR;        /*!< DMA configuration lock register                         Address offset: 0x08 */
  __IO uint32_t MISR;             /*!< DMA non secure masked interrupt status register,        Address offset: 0x0C  */
  __IO uint32_t SMISR;            /*!< DMA secure masked interrupt status register,            Address offset: 0x10  */
       uint32_t RESERVED[1003];   /*!< Reserved                                                Address offset: 0x014-0xFBC */
  __IO uint32_t HWCFGR13;         /*!< HPDMA hardware configuration 13 register                Address offset: 0xFC0 */
  __IO uint32_t HWCFGR12;         /*!< HPDMA hardware configuration 12 register                Address offset: 0xFC4 */
  __IO uint32_t HWCFGR11;         /*!< HPDMA hardware configuration 11 register                Address offset: 0xFC8 */
  __IO uint32_t HWCFGR10;         /*!< HPDMA hardware configuration 10 register                Address offset: 0xFCC */
  __IO uint32_t HWCFGR9;          /*!< HPDMA hardware configuration 9 register                 Address offset: 0xFD0 */
  __IO uint32_t HWCFGR8;          /*!< HPDMA hardware configuration 8 register                 Address offset: 0xFD4 */
  __IO uint32_t HWCFGR7;          /*!< HPDMA hardware configuration 7 register                 Address offset: 0xFD8 */
  __IO uint32_t HWCFGR6;          /*!< HPDMA hardware configuration 6 register                 Address offset: 0xFDC */
  __IO uint32_t HWCFGR5;          /*!< HPDMA hardware configuration 5 register                 Address offset: 0xFE0 */
  __IO uint32_t HWCFGR4;          /*!< HPDMA hardware configuration 4 register                 Address offset: 0xFE4 */
  __IO uint32_t HWCFGR3;          /*!< HPDMA hardware configuration 3 register                 Address offset: 0xFE8 */
  __IO uint32_t HWCFGR2;          /*!< HPDMA hardware configuration 2 register                 Address offset: 0xFEC */
  __IO uint32_t HWCFGR1;          /*!< HPDMA hardware configuration 1 register                 Address offset: 0xFF0 */
  __IO uint32_t VERR;             /*!< HPDMA version register                                  Address offset: 0xFF4 */
  __IO uint32_t IPIDR;            /*!< HPDMA identification register                           Address offset: 0xFF8 */
  __IO uint32_t SIDR;             /*!< HPDMA size identification register                      Address offset: 0xFFC */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CLBAR;        /*!< DMA channel x linked-list base address register, Address offset: 0x50 + (x * 0x80) */
  __IO uint32_t CCIDCFGR;     /*!< DMA channel x CID register,                      Address offset: 0x54 + (x * 0x80) */
  __IO uint32_t CSEMCR;       /*!< DMA channel x semaphore control register,        Address offset: 0x58 + (x * 0x80) */
  __IO uint32_t CFCR;         /*!< DMA channel x flag clear register,               Address offset: 0x5C + (x * 0x80) */
  __IO uint32_t CSR;          /*!< DMA channel x flag status register,              Address offset: 0x60 + (x * 0x80) */
  __IO uint32_t CCR;          /*!< DMA channel x control register,                  Address offset: 0x64 + (x * 0x80) */
       uint32_t RESERVED2[10];/*!< Reserved 2,                                      Address offset: 0x68 -- 0x8C      */
  __IO uint32_t CTR1;         /*!< DMA channel x transfer register 1,               Address offset: 0x90 + (x * 0x80) */
  __IO uint32_t CTR2;         /*!< DMA channel x transfer register 2,               Address offset: 0x94 + (x * 0x80) */
  __IO uint32_t CBR1;         /*!< DMA channel x block register 1,                  Address offset: 0x98 + (x * 0x80) */
  __IO uint32_t CSAR;         /*!< DMA channel x source address register,           Address offset: 0x9C + (x * 0x80) */
  __IO uint32_t CDAR;         /*!< DMA channel x destination address register,      Address offset: 0xA0 + (x * 0x80) */
  __IO uint32_t CTR3;         /*!< DMA channel x transfer register 3,               Address offset: 0xA4 + (x * 0x80) */
  __IO uint32_t CBR2;         /*!< DMA channel x block register 2,                  Address offset: 0xA8 + (x * 0x80) */
       uint32_t RESERVED3[8]; /*!< Reserved 3,                                      Address offset: 0xAC -- 0xC8      */
  __IO uint32_t CLLR;         /*!< DMA channel x linked-list address register,      Address offset: 0xCC + (x * 0x80) */
} DMA_Channel_TypeDef;


