STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233axx_ca35.h
/****************  Bit definition for GPIO_PRIVCFGR register  *****************/
#define GPIO_PRIVCFGR_PRIV0_Pos        (0U)
#define GPIO_PRIVCFGR_PRIV0_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV0_Pos)        /*!< 0x00000001 */
#define GPIO_PRIVCFGR_PRIV0            GPIO_PRIVCFGR_PRIV0_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV1_Pos        (1U)
#define GPIO_PRIVCFGR_PRIV1_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV1_Pos)        /*!< 0x00000002 */
#define GPIO_PRIVCFGR_PRIV1            GPIO_PRIVCFGR_PRIV1_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV2_Pos        (2U)
#define GPIO_PRIVCFGR_PRIV2_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV2_Pos)        /*!< 0x00000004 */
#define GPIO_PRIVCFGR_PRIV2            GPIO_PRIVCFGR_PRIV2_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV3_Pos        (3U)
#define GPIO_PRIVCFGR_PRIV3_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV3_Pos)        /*!< 0x00000008 */
#define GPIO_PRIVCFGR_PRIV3            GPIO_PRIVCFGR_PRIV3_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV4_Pos        (4U)
#define GPIO_PRIVCFGR_PRIV4_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV4_Pos)        /*!< 0x00000010 */
#define GPIO_PRIVCFGR_PRIV4            GPIO_PRIVCFGR_PRIV4_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV5_Pos        (5U)
#define GPIO_PRIVCFGR_PRIV5_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV5_Pos)        /*!< 0x00000020 */
#define GPIO_PRIVCFGR_PRIV5            GPIO_PRIVCFGR_PRIV5_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV6_Pos        (6U)
#define GPIO_PRIVCFGR_PRIV6_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV6_Pos)        /*!< 0x00000040 */
#define GPIO_PRIVCFGR_PRIV6            GPIO_PRIVCFGR_PRIV6_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV7_Pos        (7U)
#define GPIO_PRIVCFGR_PRIV7_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV7_Pos)        /*!< 0x00000080 */
#define GPIO_PRIVCFGR_PRIV7            GPIO_PRIVCFGR_PRIV7_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV8_Pos        (8U)
#define GPIO_PRIVCFGR_PRIV8_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV8_Pos)        /*!< 0x00000100 */
#define GPIO_PRIVCFGR_PRIV8            GPIO_PRIVCFGR_PRIV8_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV9_Pos        (9U)
#define GPIO_PRIVCFGR_PRIV9_Msk        (0x1UL << GPIO_PRIVCFGR_PRIV9_Pos)        /*!< 0x00000200 */
#define GPIO_PRIVCFGR_PRIV9            GPIO_PRIVCFGR_PRIV9_Msk                  /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV10_Pos       (10U)
#define GPIO_PRIVCFGR_PRIV10_Msk       (0x1UL << GPIO_PRIVCFGR_PRIV10_Pos)       /*!< 0x00000400 */
#define GPIO_PRIVCFGR_PRIV10           GPIO_PRIVCFGR_PRIV10_Msk                 /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV11_Pos       (11U)
#define GPIO_PRIVCFGR_PRIV11_Msk       (0x1UL << GPIO_PRIVCFGR_PRIV11_Pos)       /*!< 0x00000800 */
#define GPIO_PRIVCFGR_PRIV11           GPIO_PRIVCFGR_PRIV11_Msk                 /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV12_Pos       (12U)
#define GPIO_PRIVCFGR_PRIV12_Msk       (0x1UL << GPIO_PRIVCFGR_PRIV12_Pos)       /*!< 0x00001000 */
#define GPIO_PRIVCFGR_PRIV12           GPIO_PRIVCFGR_PRIV12_Msk                 /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV13_Pos       (13U)
#define GPIO_PRIVCFGR_PRIV13_Msk       (0x1UL << GPIO_PRIVCFGR_PRIV13_Pos)       /*!< 0x00002000 */
#define GPIO_PRIVCFGR_PRIV13           GPIO_PRIVCFGR_PRIV13_Msk                 /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV14_Pos       (14U)
#define GPIO_PRIVCFGR_PRIV14_Msk       (0x1UL << GPIO_PRIVCFGR_PRIV14_Pos)       /*!< 0x00004000 */
#define GPIO_PRIVCFGR_PRIV14           GPIO_PRIVCFGR_PRIV14_Msk                 /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_PRIVCFGR_PRIV15_Pos       (15U)
#define GPIO_PRIVCFGR_PRIV15_Msk       (0x1UL << GPIO_PRIVCFGR_PRIV15_Pos)       /*!< 0x00008000 */
#define GPIO_PRIVCFGR_PRIV15           GPIO_PRIVCFGR_PRIV15_Msk                 /*!< Port x privileged I/O pin y (y= 0 to 15)These bits are written by software to enabled the privileged mode for I/O port pin y.This bit can only be written by privileged application. If corresponding SECy bit is set in GPIOx_SECCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled (resp. disabled) using CFEN bit in GPIOx_CIDCFGRy, only an authorized compartment (resp. any compartment) can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */

