STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233axx_ca35.h
/****************  Bit definition for GPIO_PIOCFGRL register  *****************/
#define GPIO_ADVCFGRL_0_Pos      	(0U)
#define GPIO_ADVCFGRL_0_Msk    	  	(0xFUL << GPIO_ADVCFGRL_0_Pos)      /*!< 0x0000000F */
#define GPIO_ADVCFGRL_0          	GPIO_ADVCFGRL_0_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH0      (0x1UL << GPIO_ADVCFGRL_0_Pos)          /*!< 0x00000001 */
#define GPIO_ADVCFGRL_DE0           (0x2UL << GPIO_ADVCFGRL_0_Pos)          /*!< 0x00000002 */
#define GPIO_ADVCFGRL_INVCLK0       (0x4UL << GPIO_ADVCFGRL_0_Pos)          /*!< 0x00000004 */
#define GPIO_ADVCFGRL_RET0          (0x8UL << GPIO_ADVCFGRL_0_Pos)          /*!< 0x00000008 */
#define GPIO_ADVCFGRL_1_Pos      	(4U)
#define GPIO_ADVCFGRL_1_Msk      	(0xFUL << GPIO_ADVCFGRL_1_Pos)      /*!< 0x000000F0 */
#define GPIO_ADVCFGRL_1          	GPIO_ADVCFGRL_1_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH1      (0x1UL << GPIO_ADVCFGRL_1_Pos)          /*!< 0x00000010 */
#define GPIO_ADVCFGRL_DE1           (0x2UL << GPIO_ADVCFGRL_1_Pos)          /*!< 0x00000020 */
#define GPIO_ADVCFGRL_INVCLK1       (0x4UL << GPIO_ADVCFGRL_1_Pos)          /*!< 0x00000040 */
#define GPIO_ADVCFGRL_RET1          (0x8UL << GPIO_ADVCFGRL_1_Pos)          /*!< 0x00000080 */
#define GPIO_ADVCFGRL_2_Pos      	(8U)
#define GPIO_ADVCFGRL_2_Msk      	(0xFUL << GPIO_ADVCFGRL_2_Pos)      /*!< 0x00000F00 */
#define GPIO_ADVCFGRL_2          	GPIO_ADVCFGRL_2_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH2      (0x1UL << GPIO_ADVCFGRL_2_Pos)          /*!< 0x00000100 */
#define GPIO_ADVCFGRL_DE2           (0x2UL << GPIO_ADVCFGRL_2_Pos)          /*!< 0x00000200 */
#define GPIO_ADVCFGRL_INVCLK2       (0x4UL << GPIO_ADVCFGRL_2_Pos)          /*!< 0x00000400 */
#define GPIO_ADVCFGRL_RET2          (0x8UL << GPIO_ADVCFGRL_2_Pos)          /*!< 0x00000800 */
#define GPIO_ADVCFGRL_3_Pos      	(12U)
#define GPIO_ADVCFGRL_3_Msk      	(0xFUL << GPIO_ADVCFGRL_3_Pos)      /*!< 0x0000F000 */
#define GPIO_ADVCFGRL_3          	GPIO_ADVCFGRL_3_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH3      (0x1UL << GPIO_ADVCFGRL_3_Pos)          /*!< 0x00001000 */
#define GPIO_ADVCFGRL_DE3           (0x2UL << GPIO_ADVCFGRL_3_Pos)          /*!< 0x00002000 */
#define GPIO_ADVCFGRL_INVCLK3       (0x4UL << GPIO_ADVCFGRL_3_Pos)          /*!< 0x00004000 */
#define GPIO_ADVCFGRL_RET3          (0x8UL << GPIO_ADVCFGRL_3_Pos)          /*!< 0x00008000 */
#define GPIO_ADVCFGRL_4_Pos      	(16U)
#define GPIO_ADVCFGRL_4_Msk      	(0xFUL << GPIO_ADVCFGRL_4_Pos)      /*!< 0x000F0000 */
#define GPIO_ADVCFGRL_4          	GPIO_ADVCFGRL_4_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH4      (0x1UL << GPIO_ADVCFGRL_4_Pos)          /*!< 0x00010000 */
#define GPIO_ADVCFGRL_DE4           (0x2UL << GPIO_ADVCFGRL_4_Pos)          /*!< 0x00020000 */
#define GPIO_ADVCFGRL_INVCLK4       (0x4UL << GPIO_ADVCFGRL_4_Pos)          /*!< 0x00040000 */
#define GPIO_ADVCFGRL_RET4          (0x8UL << GPIO_ADVCFGRL_4_Pos)          /*!< 0x00080000 */
#define GPIO_ADVCFGRL_5_Pos      	(20U)
#define GPIO_ADVCFGRL_5_Msk      	(0xFUL << GPIO_ADVCFGRL_5_Pos)      /*!< 0x00F00000 */
#define GPIO_ADVCFGRL_5          	GPIO_ADVCFGRL_5_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH5      (0x1UL << GPIO_ADVCFGRL_5_Pos)          /*!< 0x00100000 */
#define GPIO_ADVCFGRL_DE5           (0x2UL << GPIO_ADVCFGRL_5_Pos)          /*!< 0x00200000 */
#define GPIO_ADVCFGRL_INVCLK5       (0x4UL << GPIO_ADVCFGRL_5_Pos)          /*!< 0x00400000 */
#define GPIO_ADVCFGRL_RET5          (0x8UL << GPIO_ADVCFGRL_5_Pos)          /*!< 0x00800000 */
#define GPIO_ADVCFGRL_6_Pos      	(24U)
#define GPIO_ADVCFGRL_6_Msk      	(0xFUL << GPIO_ADVCFGRL_6_Pos)      /*!< 0x0F000000 */
#define GPIO_ADVCFGRL_6          	GPIO_ADVCFGRL_6_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH6      (0x1UL << GPIO_ADVCFGRL_6_Pos)          /*!< 0x01000000 */
#define GPIO_ADVCFGRL_DE6           (0x2UL << GPIO_ADVCFGRL_6_Pos)          /*!< 0x02000000 */
#define GPIO_ADVCFGRL_INVCLK6       (0x4UL << GPIO_ADVCFGRL_6_Pos)          /*!< 0x04000000 */
#define GPIO_ADVCFGRL_RET6          (0x8UL << GPIO_ADVCFGRL_6_Pos)          /*!< 0x08000000 */
#define GPIO_ADVCFGRL_7_Pos      	(28U)
#define GPIO_ADVCFGRL_7_Msk      	(0xFUL << GPIO_ADVCFGRL_7_Pos)      /*!< 0xF0000000 */
#define GPIO_ADVCFGRL_7          	GPIO_ADVCFGRL_7_Msk                /*!< [3:0]: Port x IO pin configuration (y = 0 to 7)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRL_DLYPATH7      (0x1UL << GPIO_ADVCFGRL_7_Pos)          /*!< 0x10000000 */
#define GPIO_ADVCFGRL_DE7           (0x2UL << GPIO_ADVCFGRL_7_Pos)          /*!< 0x20000000 */
#define GPIO_ADVCFGRL_INVCLK7       (0x4UL << GPIO_ADVCFGRL_7_Pos)          /*!< 0x40000000 */
#define GPIO_ADVCFGRL_RET7          (0x8UL << GPIO_ADVCFGRL_7_Pos)          /*!< 0x80000000 */

/****************  Bit definition for GPIO_PIOCFGRH register  *****************/
#define GPIO_ADVCFGRH_8_Pos      	(0U)
#define GPIO_ADVCFGRH_8_Msk      	(0xFUL << GPIO_ADVCFGRH_8_Pos)      /*!< 0x0000000F */
#define GPIO_ADVCFGRH_8          	GPIO_ADVCFGRH_8_Msk                /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH8      (0x1UL << GPIO_ADVCFGRH_8_Pos)          /*!< 0x00000001 */
#define GPIO_ADVCFGRH_DE8           (0x2UL << GPIO_ADVCFGRH_8_Pos)          /*!< 0x00000002 */
#define GPIO_ADVCFGRH_INVCLK8       (0x4UL << GPIO_ADVCFGRH_8_Pos)          /*!< 0x00000004 */
#define GPIO_ADVCFGRH_RET8          (0x8UL << GPIO_ADVCFGRH_8_Pos)          /*!< 0x00000008 */
#define GPIO_ADVCFGRH_9_Pos      	(4U)
#define GPIO_ADVCFGRH_9_Msk      	(0xFUL << GPIO_ADVCFGRH_9_Pos)      /*!< 0x000000F0 */
#define GPIO_ADVCFGRH_9          	GPIO_ADVCFGRH_9_Msk                /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH9      (0x1UL << GPIO_ADVCFGRH_9_Pos)          /*!< 0x00000010 */
#define GPIO_ADVCFGRH_DE9           (0x2UL << GPIO_ADVCFGRH_9_Pos)          /*!< 0x00000020 */
#define GPIO_ADVCFGRH_INVCLK9       (0x4UL << GPIO_ADVCFGRH_9_Pos)          /*!< 0x00000040 */
#define GPIO_ADVCFGRH_RET9          (0x8UL << GPIO_ADVCFGRH_9_Pos)          /*!< 0x00000080 */
#define GPIO_ADVCFGRH_10_Pos     	(8U)
#define GPIO_ADVCFGRH_10_Msk     	(0xFUL << GPIO_ADVCFGRH_10_Pos)     /*!< 0x00000F00 */
#define GPIO_ADVCFGRH_10         	GPIO_ADVCFGRH_10_Msk               /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH10     (0x1UL << GPIO_ADVCFGRH_10_Pos)         /*!< 0x00000100 */
#define GPIO_ADVCFGRH_DE10          (0x2UL << GPIO_ADVCFGRH_10_Pos)         /*!< 0x00000200 */
#define GPIO_ADVCFGRH_INVCLK10      (0x4UL << GPIO_ADVCFGRH_10_Pos)         /*!< 0x00000400 */
#define GPIO_ADVCFGRH_RET10         (0x8UL << GPIO_ADVCFGRH_10_Pos)         /*!< 0x00000800 */
#define GPIO_ADVCFGRH_11_Pos     	(12U)
#define GPIO_ADVCFGRH_11_Msk     	(0xFUL << GPIO_ADVCFGRH_11_Pos)     /*!< 0x0000F000 */
#define GPIO_ADVCFGRH_11         	GPIO_ADVCFGRH_11_Msk               /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH11     (0x1UL << GPIO_ADVCFGRH_11_Pos)         /*!< 0x00001000 */
#define GPIO_ADVCFGRH_DE11          (0x2UL << GPIO_ADVCFGRH_11_Pos)         /*!< 0x00002000 */
#define GPIO_ADVCFGRH_INVCLK11      (0x4UL << GPIO_ADVCFGRH_11_Pos)         /*!< 0x00004000 */
#define GPIO_ADVCFGRH_RET11         (0x8UL << GPIO_ADVCFGRH_11_Pos)         /*!< 0x00008000 */
#define GPIO_ADVCFGRH_12_Pos    	(16U)
#define GPIO_ADVCFGRH_12_Msk     	(0xFUL << GPIO_ADVCFGRH_12_Pos)     /*!< 0x000F0000 */
#define GPIO_ADVCFGRH_12         	GPIO_ADVCFGRH_12_Msk               /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH12     (0x1UL << GPIO_ADVCFGRH_12_Pos)         /*!< 0x00010000 */
#define GPIO_ADVCFGRH_DE12          (0x2UL << GPIO_ADVCFGRH_12_Pos)         /*!< 0x00020000 */
#define GPIO_ADVCFGRH_INVCLK12      (0x4UL << GPIO_ADVCFGRH_12_Pos)         /*!< 0x00040000 */
#define GPIO_ADVCFGRH_RET12         (0x8UL << GPIO_ADVCFGRH_12_Pos)         /*!< 0x00080000 */
#define GPIO_ADVCFGRH_13_Pos     	(20U)
#define GPIO_ADVCFGRH_13_Msk     	(0xFUL << GPIO_ADVCFGRH_13_Pos)     /*!< 0x00F00000 */
#define GPIO_ADVCFGRH_13         	GPIO_ADVCFGRH_13_Msk               /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH13     (0x1UL << GPIO_ADVCFGRH_13_Pos)         /*!< 0x00100000 */
#define GPIO_ADVCFGRH_DE13          (0x2UL << GPIO_ADVCFGRH_13_Pos)         /*!< 0x00200000 */
#define GPIO_ADVCFGRH_INVCLK13      (0x4UL << GPIO_ADVCFGRH_13_Pos)         /*!< 0x00400000 */
#define GPIO_ADVCFGRH_RET13         (0x8UL << GPIO_ADVCFGRH_13_Pos)         /*!< 0x00800000 */
#define GPIO_ADVCFGRH_14_Pos     	(24U)
#define GPIO_ADVCFGRH_14_Msk     	(0xFUL << GPIO_ADVCFGRH_14_Pos)     /*!< 0x0F000000 */
#define GPIO_ADVCFGRH_14         	GPIO_ADVCFGRH_14_Msk               /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH14     (0x1UL << GPIO_ADVCFGRH_14_Pos)         /*!< 0x01000000 */
#define GPIO_ADVCFGRH_DE14          (0x2UL << GPIO_ADVCFGRH_14_Pos)         /*!< 0x02000000 */
#define GPIO_ADVCFGRH_INVCLK14      (0x4UL << GPIO_ADVCFGRH_14_Pos)         /*!< 0x04000000 */
#define GPIO_ADVCFGRH_RET14         (0x8UL << GPIO_ADVCFGRH_14_Pos)         /*!< 0x08000000 */
#define GPIO_ADVCFGRH_15_Pos     	(28U)
#define GPIO_ADVCFGRH_15_Msk     	(0xFUL << GPIO_ADVCFGRH_15_Pos)     /*!< 0xF0000000 */
#define GPIO_ADVCFGRH_15         	GPIO_ADVCFGRH_15_Msk               /*!< [3:0]: Port x IO pin y configuration (y = 8 to 15)Successful read or write to this bit must be secure if SECy bit is set in GPIOx_SECCFGR, and must be privileged if PRIVy bit is set in GPIOx_PRIVCFGR.Only authorized CPU can read or write this bit, as described in Section1.4: IO pin allocation to compartments. Illegal read returns zero. Illegal write is ignored. */
#define GPIO_ADVCFGRH_DLYPATH15     (0x1UL << GPIO_ADVCFGRH_15_Pos)         /*!< 0x10000000 */
#define GPIO_ADVCFGRH_DE15          (0x2UL << GPIO_ADVCFGRH_15_Pos)         /*!< 0x20000000 */
#define GPIO_ADVCFGRH_INVCLK15      (0x4UL << GPIO_ADVCFGRH_15_Pos)         /*!< 0x40000000 */
#define GPIO_ADVCFGRH_RET15         (0x8UL << GPIO_ADVCFGRH_15_Pos)         /*!< 0x80000000 */

/****************  Bit definition for GPIO_CIDCFGR0 register  *****************/
#define GPIO_CIDCFGR0_CFEN_Pos         (0U)
#define GPIO_CIDCFGR0_CFEN_Msk         (0x1UL << GPIO_CIDCFGR0_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR0_CFEN             GPIO_CIDCFGR0_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR0_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR0_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR0_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR0_SEM_EN           GPIO_CIDCFGR0_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR0_SCID_Pos         (4U)
#define GPIO_CIDCFGR0_SCID_Msk         (0x3UL << GPIO_CIDCFGR0_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR0_SCID             GPIO_CIDCFGR0_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR0_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR0_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR0_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR0_SEMWLC0          GPIO_CIDCFGR0_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR0_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR0_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR0_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR0_SEMWLC1          GPIO_CIDCFGR0_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR0_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR0_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR0_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR0_SEMWLC2          GPIO_CIDCFGR0_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR0_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR0_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR0_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR0_SEMWLC3          GPIO_CIDCFGR0_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR0 register  ******************/
#define GPIO_SEMCR0_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR0_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR0_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR0_SEM_MUTEX          GPIO_SEMCR0_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR0_SEMCID_Pos         (4U)
#define GPIO_SEMCR0_SEMCID_Msk         (0x3UL << GPIO_SEMCR0_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR0_SEMCID             GPIO_SEMCR0_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR1 register  *****************/
#define GPIO_CIDCFGR1_CFEN_Pos         (0U)
#define GPIO_CIDCFGR1_CFEN_Msk         (0x1UL << GPIO_CIDCFGR1_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR1_CFEN             GPIO_CIDCFGR1_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR1_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR1_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR1_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR1_SEM_EN           GPIO_CIDCFGR1_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR1_SCID_Pos         (4U)
#define GPIO_CIDCFGR1_SCID_Msk         (0x3UL << GPIO_CIDCFGR1_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR1_SCID             GPIO_CIDCFGR1_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR1_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR1_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR1_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR1_SEMWLC0          GPIO_CIDCFGR1_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR1_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR1_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR1_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR1_SEMWLC1          GPIO_CIDCFGR1_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR1_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR1_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR1_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR1_SEMWLC2          GPIO_CIDCFGR1_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR1_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR1_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR1_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR1_SEMWLC3          GPIO_CIDCFGR1_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR1 register  ******************/
#define GPIO_SEMCR1_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR1_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR1_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR1_SEM_MUTEX          GPIO_SEMCR1_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR1_SEMCID_Pos         (4U)
#define GPIO_SEMCR1_SEMCID_Msk         (0x3UL << GPIO_SEMCR1_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR1_SEMCID             GPIO_SEMCR1_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR2 register  *****************/
#define GPIO_CIDCFGR2_CFEN_Pos         (0U)
#define GPIO_CIDCFGR2_CFEN_Msk         (0x1UL << GPIO_CIDCFGR2_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR2_CFEN             GPIO_CIDCFGR2_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR2_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR2_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR2_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR2_SEM_EN           GPIO_CIDCFGR2_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR2_SCID_Pos         (4U)
#define GPIO_CIDCFGR2_SCID_Msk         (0x3UL << GPIO_CIDCFGR2_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR2_SCID             GPIO_CIDCFGR2_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR2_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR2_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR2_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR2_SEMWLC0          GPIO_CIDCFGR2_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR2_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR2_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR2_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR2_SEMWLC1          GPIO_CIDCFGR2_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR2_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR2_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR2_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR2_SEMWLC2          GPIO_CIDCFGR2_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR2_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR2_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR2_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR2_SEMWLC3          GPIO_CIDCFGR2_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

